"use client"
import { useEffect } from "react";
import AOS from "aos"
import 'aos/dist/aos.css'
import Image from "next/image";
const TermsAndCondition =  () => {
  useEffect(()=>{
    AOS.init({
      duration:1000,
      easing: 'ease-in-out',
      once: false
    })

  })
  
  return (
    <main dir="rtl" className="bg-gray-300/20  ">
      {/* <header className="flex items-center  justify-center  p-0 h-[34rem] ">
      </header> */}

      <h1 className="text-4xl bg-gray-300/20 text-center pt-20 pb-5   font-sans font-black ">
          الشروط و الاحكام
        </h1>
      <section className=" bg-gray-300/20 m-0  sm:px-40 py-10">
        <article data-aos="zoom-in"  className=" bg-blue-800/80 hover:bg-blue-900/80 font-sans text-neutral-100 rounded-md  p-10 my-5">
          <h1 className="text-2xl mb-2   font-sans font-bold">
            اخلاء المسؤولية التنازل عن المطالبات
          </h1>
          <hr className=" m-4 border-white/40 " />
          <p className="my-2 ">
            إن البوابة الإلكترونية شركة سمسار العربية للسيارات والخدمات المقدمة
            من خلالها والمعلومات والمواد والوظائف المتاحة عليها أو التي يمكن
            الوصول إليها من خلال البوابة يتم توفيرها لاستخدامكم الشخصي “كما هي”
            و “كما هي متاحة” دون أي إقرار أو وعود أو ضمانات من أي نوع. ولا
            يمكننا أن نضمن أو أن نتحمل المسؤولية عن أية انقطاعات أو أخطاء أو
            تجاوزات قد تنشأ عن استخدام هذه البوابة أو محتوياتها أو أي موقع يرتبط
            بها -سواء كان ذلك بعلمنا أو بدون علمنا. إن أية اتصالات أو معلومات قد
            يقوم المستخدم بإرسالها من خلال هذه البوابة لن يكون له الحق في
            ملكيتها أو حق ضمان سريتها كما أن أي استخدام عام أو تفاعلي بشكل خاص
            تتضمنه هذه البوابة لا تضمن أو لا يقصد بها أن تضمن للمستخدم أي حقوق
            أو تراخيص أو أية امتيازات من أي نوع. وفي حالة تنازلت الوزارة عن أي
            حق متاح لها ومحدد ضمن هذه الشروط في أحد الأماكن أو إحدى المناسبات،
            فإن ذلك لا يعني بأي حال تنازلاً تلقائياً وبشكل دائم عن أية حقوق في
            أماكن ومناسبات أخرى
          </p>
        </article>
        <article data-aos="zoom-in"  className=" bg-blue-800/80 hover:bg-blue-900/80 font-sans text-neutral-100 rounded-md  p-10 my-5">
          <h1 className="text-2xl my-2 font-sans font-bold">
            الحماية من الفيروسات
          </h1>
          <hr className=" my-4 border-white/40 " />

          <p className="my-2">
            تبذل تقنية المعلومات شركة سمسار العربية للسيارات جهداً لفحص واختبار
            محتويات الخدمات الإلكترونية سمسار العربية للسيارات في كل مراحل
            العمل، وننصحك بأن تقوم دائما بتشغيل برنامج مضاد للفيروسات على كل
            المواد التي يتم تحميلها من الإنترنت. ونحن لا نتحمل أية مسؤولية عن
            أية خسارة أو انقطاع أو تلف لبياناتك أو جهاز الحاسب لديك والذي قد
            يحدث أثناء الاتصال بهذه البوابة أو عند استخدام أية مواد من محتوى أو
            غيره ما يرد فيه
          </p>
        </article>
        <article data-aos="zoom-in"  className=" bg-blue-800/80 hover:bg-blue-900/80 font-sans text-neutral-100 rounded-md  p-10 my-5">
          <h1 className="text-2xl my-2 font-sans font-bold">
            إنهاء الاستخدام
          </h1>
          <hr className=" my-4 border-white/40 " />

          <p className="my-2">
            جوز لتقنية المعلومات وحسب تقديرها المطلق إنهاء أو تقييد أو إيقاف حقك
            في الدخول إلى البوابة أو واستخدامها الخدمات المقدمة من خلالها وذلك
            دون إشعار ولأي سبب بما في ذلك مخالفة شروط وبنود الاستخدام أو أي سلوك
            آخر قد تعتبره الإدارة حسب تقديرها الخاص غير قانوني أو مضراً
            بالآخرين، وفي حالة الإنهاء، فإنه لن يكون مصرحاً لك بالدخول
          </p>
        </article>
        <article data-aos="zoom-in"  className=" bg-blue-800/80 hover:bg-blue-900/80 font-sans text-neutral-100 rounded-md  p-10 my-5">
          <h1 className="text-2xl my-2 font-sans font-bold">
            شروط عامة
          </h1>
          <hr className=" my-4 border-white/40 " />

          <p className="my-2">
            إن كل المواد والمعلومات والخدمات المتوفرة على البوابة الإلكترونية
            نقدمها كما هي ولا نضمن دقتها أو يُعتمد عليها كعروض أسعار وهي غير
            ملزمة للشركة بأي حال من الأحوال . إن اللغة العربية هي اللغة الأساسية
            لاستخدام البوابة والاستفادة من كل المواد المنشورة عليها، ويهدف ترجمة
            أي من هذه المواد لتقديم خدمة مضافة، وعليه فلا يتم الاستناد إلى
            الترجمة المتوفرة في تفسير أي خلاف حول ما تتضمنه البوابة من محتوى.
            دخولك واستخدامك الموقع الإلكتروني شركة سمسار العربية للسيارات يخضع
            للشروط والأحكام الآتية. دخولك إلى الموقع يعني موافقتك على هذه الشروط
            والأحكام، سواء أكنت مستخدماً مسجلاً أم لا. وبدخولك وتصفحك واستخدامك
            الموقع تكون قد قبلت، من دون قيد أو شرط، أحكام وشروط الاستخدام
            الواردة في هذه الوثيقة. أنت توافق على دخول واستخدام الموقع لأغراض
            مشروعة فقط، وأنت مسؤول مسؤولية كاملة عن العلم والعمل بأي من وكل
            القوانين والأنظمة والقواعد والأحكام المتعلقة باستخدامك له. وبمجرد
            دخولك إلى الموقع فإنك توافق على الامتناع عن: استخدام الموقع من أجل
            ارتكاب جرم أو تشجيع الآخرين على التورط في أي تصرف قد يعد جريمة أو
            ينطوي على مسؤولية مدنية. إدخال أو نشر أي محتويات غير قانونية تتضمن
            تمييزاً أو تشهيراً أو إساءة أو قذفاً أو مواد غير لائقة. استخدام
            الموقع من أجل انتحال شخصيات أو أطراف أخرى.استخدام الموقع لتحميل أي
            مادة فيها برامج تحتوي على فيروسات، أو “أحصنة طروادة”، أو أي شفرات
            حاسوبية أو ملفات أو برامج قد تعمل على تغيير أو إتلاف أو إعاقة عمل
            الموقع أو أي جهاز أو برنامج عائد إلى أي شخص يدخل إلى الموقع. تحميل
            أو إدخال أو إرسال أو أي بث بخلاف ذلك لمواد لا يحق لك بثها بموجب أي
            قانون أو علاقة تعاقدية. تغيير أو إتلاف أو شطب أي محتوى على الموقع
            تعطيل خطوط الاتصال الاعتيادية بأي شكل كان الادعاء بالارتباط مع، أو
            تمثيل أي شركة أو جمعية أو هيئة من دون أن تكون مخولاً بادعاء تلك
            العلاقة أو ذلك التمثيل. نشر أو بث أي إعلان أو مادة دعائية أو أي شكل
            من أشكال الترويج. نشر أي مادة تتنافى أو تتعارض مع حقوق الملكية
            الفكرية للآخرين، أو جمع أو تخزين المعلومات الشخصية عن الآخرين.
          </p>
        </article>
        <article data-aos="zoom-in"  className=" bg-blue-800/80 hover:bg-blue-900/80 font-sans text-neutral-100 rounded-md  p-10 my-5">
          <h1 className="text-2xl my-2 font-sans font-bold">
            لتسجيل
          </h1>
          <hr className=" my-4 border-white/40 " />

          <p className="my-2">
            عبر إدخال المعلومات الشخصية، أنت توافق على أن أي معلومات تقدم لنا
            عبر تلك الأجزاء هي معلومات كاملة ودقيقة، وأنك لن تقوم بالتسجيل، ولن
            تحاول دخول الموقع مستخدماً اسم شخص آخر، ولن تتبنى اسم مستخدم قد ترى
            شركة سمسار العربية للسيارات أنه وفق حقها في حرية التصرف، غير مناسب.
          </p>
        </article>
        <article data-aos="zoom-in"  className=" bg-blue-800/80 hover:bg-blue-900/80 font-sans text-neutral-100 rounded-md  p-10 my-5">
          <h1 className="text-2xl my-2 font-sans font-bold">
            المحتوى
          </h1>
          <hr className=" my-4 border-white/40 " />

          <p className="my-2">
            تحتفظ شركة سمسار العربية للسيارات بالحق في مراقبة أي محتوى يتم
            إدخاله من قبلك، غير أنها ليست ملزمة بذلك، ومع أن شركة سمسار العربية
            للسيارات لا تستطيع مراقبة كل ما يتم إدخاله سواء على البوابة
            الإلكترونية والخدمات الإلكترونية المقدمة من خلالها، فإننا نحتفظ
            بالحق (من دون التزام) في شطب أو إزالة أو تحرير أي مواد مدخلة من
            شأنها انتهاك هذه الشروط والأحكام.
          </p>
        </article>
      </section>
    </main>
  );
};

export default TermsAndCondition;
